//package com.example.gettingbiology
//
//import android.os.Parcelable
//import kotlinx.parcelize.Parcelize
//import java.io.Serializable
//
//object QuizData {
//    private val allQuestions: List<Question> = listOf(
//        Question(
//            "Кои от изброените съединения са белтъци?",
//            listOf("холестерол и хемоглобин", "витамин С и витамин Д", "малтаза и пепсин", "АТФ и НАД"),
//            "малтаза и пепсин"
//        ),
//        Question(
//            "Някои вируси имат мембраноподобна обвивка, която е образувана от:",
//            listOf("белтъци и липиди, синтезирани от вируса", "част от плазмената мембрана на клетката гостоприемник", "белтъци, синтезирани от вируса и липиди от клетката-гостоприемник", "липиди, синтезирани от вируса и белтъци от клетката-гостоприемник"),
//            "белтъци, синтезирани от вируса и липиди от клетката-гостоприемник"
//        ),
//        Question(
//            "Кое от изброеното е основно положение на клетъчната теория?",
//            listOf("Организмите са групирани в 5 царства – Монера, Протиста, Растения, Животни и Гъби.", "Прокариотните организми са просто устроени – изградени само от една клетка.", "Многоклетъчните организми са възникнали от едноклетъчните.", "Клетките се размножават чрез делене."),
//            "Клетките се размножават чрез делене."
//        ),
//        Question(
//            "На фигурата е представена прокариотна клетка, тъй като:",
//            listOf("има голям брой рибозоми", "се придвижва с камшичета", "наследствената информация е кръгова ДНК", "синтезата на белтъци се извършва в цитозола"),
//            "наследствената информация е кръгова ДНК"
//        ),
//        Question(
//            "Ако една клетка има добре развита зърнеста ендоплазмена мрежа, то тя със сигурност е:",
//            listOf("жлезиста клетка от панкреаса", "чернодробна клетка", "мускулна клетка", "сперматозоид"),
//            "жлезиста клетка от панкреаса"
//        ),
//        Question(
//            "Хроматинът:",
//            listOf("се състои от ДНК и белтъци", "е характерен за митохондриите", "се деспирализира през профаза на митозата", "е неактивен през интерфаза, поради силната си кондензация"),
//                "се състои от ДНК и белтъци"
//            ),
//            Question(
//                "За гликолизата е вярно, че:",
//                listOf("е катаболитна верига в цитозола на всички клетки", "протича само в прокариотни клетки", "крайни продукти са СО2 и Н2О", "е аеробен метаболитен път"),
//                "е катаболитна верига в цитозола на всички клетки"
//            ),
//            Question(
//                "При процеса транслация върху:",
//                listOf("ДНК се синтезира ДНК", "ДНК се синтезира РНК", "иРНК се синтезира полипептид", "полипептидна верига се синтезира РНК"),
//                "иРНК се синтезира полипептид"
//            ),
//            Question(
//                "Кои от твърденията за представеното на схемата клетъчно делене са верни?",
//                listOf("Хромозомите се движат към екватора на делителното вретено", "На схемата е представено делене на прокариотна клетка", "На схемата е представена анафаза от митотично делене", "Всяка от хромозомите съдържа по две ДНК молекули"),
//                "На схемата е представена анафаза от митотично делене"
//            ),
//            Question(
//                "При кръстосване на индивиди с генотип AaBb × AaBb, каква е вероятността в потомството да има индивиди с генотип ААВВ?",
//                listOf("1/2", "1/4", "1/8", "1/16"),
//                "1/16"
//            ),
//            Question(
//                "Общото между генните, хромозомните и геномните мутации е, че:",
//                listOf("се унаследяват", "обикновено са доминантни", "винаги се проявяват фенотипно", "могат да се наблюдават с микроскоп"),
//                "се унаследяват"
//            ),
//        Question(
//            "Клетките на епителната тъкан:",
//            listOf("имат свойството възбудимост", "са плътно допрени една до друга", "съдържат в цитоплазмата си миофибрили", "могат да фагоцитират чуждеродни частици"),
//            "са плътно допрени една до друга"
//        ),
//        Question(
//            "Кой от изброените органи е сързан ПОГРЕШНО с функцията, кято изпълнява?",
//            listOf("ларинкс – гласообразуване", "тънко черво – храносмилане", "жълто тяло – секреция на прогестерон", "дебело черво – всмукване на хранителни вещества"),
//            "дебело черво – всмукване на хранителни вещества"),
//        Question(
//            "Коя кост образува предния свод на черепния покрив?",
//            listOf("теменната", "челната", "скочната", "клиновидната"),
//            "челната"
//        ),
//        Question(
//            "Хора с кръвна група 0 притежават:",
//            listOf("А антигени в плазмата", "В антигени по еритроцитите", "анти-А и анти-В антитела по еритроцитите", "анти-А и анти-В антитела в плазмата"),
//            "анти-А и анти-В антитела в плазмата"
//        ),
//        Question(
//            "Екосистемата е единство на:",
//            listOf("биотоп и паратоп", "биотоп и биоценоза", "биоценоза и биосфера", "консументи и редуценти"),
//            "биотоп и биоценоза"
//        ),
//        Question(
//            "Кое не е вярно за хрущялната тъкан?",
//            listOf("изградена е от хондроцити", "изградена е от адипоцити", "съдържа влакна и междуклетъчно вещество", "съдържа колаген и еластин"),
//            "изградена е от адипоцити"
//        ),
//        Question(
//            "Конституционната борба за съществуване се води:",
//            listOf("с резките промени в условията на средата", "с генния дрейф", "между индивиди от един и същи вид", "между индивиди от различни видове"),
//                "между индивиди от един и същи вид"
//            ),
//            Question(
//                "Кое не е неалелно взаимодействие?",
//                listOf("полимерно", "епистатично", "кодоминиращо", "комплементарно"),
//                "кодоминиращо"
//            ),
//            Question(
//                "В хода на ембрионалното развитие се преминава последователно през:",
//                listOf("сегментация, гаструлация, органогенеза", "гаструлация, органогенеза, сегментация", "органогенеза, гаструлация, сегментация", "сегментация, органогенеза, гаструлация"),
//                "сегментация, гаструлация, органогенеза"
//            ),
//            Question(
//                "Коя е правилната последователност?",
//                listOf("профаза, анафаза, метафаза, телофаза", "метафаза, профаза, телофаза, анафаза", "телофаза, метафаза, анафаза, профаза", "профаза, метафаза, анафаза, т елофаза"),
//                    "профаза, метафаза, анафаза, телофаза"
//                ),
//                Question(
//                    "Кое е вярно за генетичния код?",
//                    listOf("неприпокриващ се", "припокриващ се", "комплементарен", "некомплементарен"),
//                    "неприпокриващ се"
//                ),
//                Question(
//                    "Кросинговър се осъществява през:",
//                    listOf("профаза на първо мейотично делене", "профаза на второ мейотично делене", "анафаза на първо мейотично делене", "анафаза на второ мейотично делене"),
//                    "профаза на първо мейотично делене"
//                ),
//                Question(
//                    "Кое е вярно за антикодоните?",
//                    listOf("съдържат се в иРНК", "съдържат се в тРНК", "състоят се от аминокиселини", "състоят се от тилакоиди"),
//                    "съдържат се в тРНК"
//                ),
//                Question(
//                    "Според функцията си невроните са:",
//                    listOf("крайни и междинни", "моторни и сетивни", "мултиполярни и биполярни", "униполярни и псевдоуниполярни"),
//                    "моторни и сетивни"
//                )
//    )
//
//
//
//    fun getRandomQuestions(): List<Question> {
//        return allQuestions.shuffled().take(30)
//    }
//}
//
//@Parcelize
//data class Question(
//    val questionText: String,
//    val options: List<String>,
//    val correctAnswer: String
//) : Parcelable
